hathach/tinyusb/src/portable/wch/CH585SFR.h
#define  bAIN8              (1<<1)                    // PA1
#define  bMOSI1             (1<<1)

#define  bAIN7              (1<<2)                    // PA2
#define  bMISO1             (1<<2)
#define  bTMR3_             (1<<2)
#define  bCAP3_             bTMR3_
#define  bPWM3_             bTMR3_
#define  bRI                (1<<2)

#define  bAIN6              (1<<3)                    // PA3

#define  bAIN0              (1<<4)                    // PA4
#define  bRXD3              (1<<4)                    // PA4

#define  bAIN1              (1<<5)                    // PA5
#define  bTXD3              (1<<5)                    // PA5

#define  bAIN10             (1<<6)                    // PA6
#define  bRXD2              (1<<6)                    // PA6
#define  bPWM4_             (1<<6)                    // PA6

#define  bAIN11             (1<<7)                    // PA7
#define  bTXD2              (1<<7)                    // PA7
#define  bPWM5_             (1<<7)                    // PA7

#define  bAIN12             (1<<8)                    // PA8
#define  bRXD1              (1<<8)                    // PA8
#define  bTIO_              (1<<8)                    // PA8

#define  bAIN13             (1<<9)                    // PA9
#define  bTMR0              (1<<9)                    // PA9
#define  bCAP0              bTMR0
#define  bPWM0              bTMR0
#define  bTXD1              (1<<9)                    // PA9
#define  bTCK_              (1<<9)                    // PA9

#define  bX32KI             (1<<10)                   // PA10
#define  bTMR1              (1<<10)                   // PA10
#define  bCAP1              bTMR1
#define  bPWM1              bTMR1

#define  bX32KO             (1<<11)                   // PA11
#define  bTMR2              (1<<11)                   // PA11
#define  bCAP2              bTMR2
#define  bPWM2              bTMR2

#define  bAIN2              (1<<12)                   // PA12
#define  bPWM4              (1<<12)                   // PA12
#define  bSCS               (1<<12)                   // PA12

#define  bAIN3              (1<<13)                   // PA13
#define  bSCK0              (1<<13)                   // PA13
#define  bPWM5              (1<<13)                   // PA13

#define  bAIN4              (1<<14)                   // PA14
#define  bMOSI0             (1<<14)                   // PA14
#define  bTXD0_             (1<<14)                   // PA14

#define  bAIN5              (1<<15)                   // PA15
#define  bMISO0             (1<<15)                   // PA15
#define  bRXD0_             (1<<15)                   // PA15

#define  bPWM6              (1<<0)                    // PB0
#define  bCTS               (1<<0)                    // PB0

#define  bDSR               (1<<1)                    // PB1
#define  bPWM7_             (1<<1)                    // PB1

#define  bPWM8_             (1<<2)                    // PB2

#define  bDCD               (1<<3)                    // PB3
#define  bPWM9_             (1<<3)                    // PB3

#define  bPWM7              (1<<4)                    // PB4
#define  bRXD0              (1<<4)                    // PB4

#define  bDTR               (1<<5)                    // PB5

#define  bRTS               (1<<6)                    // PB6
#define  bPWM8              (1<<6)                    // PB6

#define  bTXD0              (1<<7)                    // PB7
#define  bPWM9              (1<<7)                    // PB7

#define  bUDM               (1<<10)                   // PB10
#define  bTMR1_             (1<<10)                   // PB10
#define  bCAP1_             bTMR1_
#define  bPWM1_             bTMR1_

#define  bUDP               (1<<11)                   // PB11
#define  bTMR2_             (1<<11)                   // PB11
#define  bCAP2_             bTMR2_
#define  bPWM2_             bTMR2_

#define  bU2DM              (1<<12)                   // PB12
#define  bSCS0_             (1<<12)                   // PB12
#define  bRXD1_             (1<<12)                   // PB12
#define  bSDA               (1<<12)                   // PB12

#define  bU2DP              (1<<13)                   // PB13
#define  bSCK0_             (1<<13)                   // PB13
#define  bTXD1_             (1<<13)                   // PB13
#define  bSCL               (1<<13)                   // PB13

#define  bTIO               (1<<14)                   // PB14
#define  bDSR_              (1<<14)                   // PB14
#define  bMOSI0_            (1<<14)                   // PB14
#define  bPWM10             (1<<14)                   // PB14

#define  bTCK               (1<<15)                   // PB15
#define  bMISO0_            (1<<15)                   // PB15
#define  bDTR_              (1<<15)                   // PB15

#define  bRXD3_             (1<<20)                   // PB20      
#define  bSDA_              (1<<20)                   // PB20      

#define  bTXD3_             (1<<21)                   // PB21  
#define  bSCL_              (1<<21)                   // PB21  

#define  bRXD2_             (1<<22)                   // PB22
#define  bTMR3              (1<<22)                   // PB22
#define  bCAP3              bTMR3
#define  bPWM3              bTMR3

#define  bRST               (1<<23)                   // PB23
#define  bTMR0_             (1<<23)                   // PB23
#define  bCAP0_             bTMR0_
#define  bPWM0_             bTMR0_
#define  bTXD2_             (1<<23)                   // PB23
#define  bPWM11             (1<<23)                   // PB23

/* Timer0 register */
#define R32_TMR0_CONTROL    (*((PUINT32V)0x40002000)) // RW, TMR0 control
#define R8_TMR0_CTRL_MOD    (*((PUINT8V)0x40002000))  // RW, TMR0 mode control
#define R8_TMR0_CTRL_DMA    (*((PUINT8V)0x40002001))  // RW, TMR0 DMA control
#define R8_TMR0_INTER_EN    (*((PUINT8V)0x40002002))  // RW, TMR0 interrupt enable
#define R8_TMR0_INT_FLAG    (*((PUINT8V)0x40002006))  // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT  (*((PUINT8V)0x40002007))  // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT      (*((PUINT32V)0x40002008)) // RO, TMR0 current count
#define R16_TMR0_COUNT      (*((PUINT16V)0x40002008)) // RO, TMR0 current count
#define R8_TMR0_COUNT       (*((PUINT8V)0x40002008))  // RO, TMR0 current count
#define R32_TMR0_CNT_END    (*((PUINT32V)0x4000200C)) // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO       (*((PUINT32V)0x40002010)) // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO       (*((PUINT16V)0x40002010)) // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO        (*((PUINT8V)0x40002010))  // RO/WO, TMR0 FIFO register
#define R32_TMR0_DMA_NOW    (*((PUINT32V)0x40002014)) // RW, TMR0 DMA current address
#define R32_TMR0_DMA_BEG    (*((PUINT32V)0x40002018)) // RW, TMR0 DMA begin address
#define R32_TMR0_DMA_END    (*((PUINT32V)0x4000201C)) // RW, TMR0 DMA end address

