hathach/tinyusb/src/portable/wch/CH585SFR.h
/* USB endpoint type and attributes */
#ifndef USB_ENDP_TYPE_MASK
#define USB_ENDP_DIR_MASK       0x80
#define USB_ENDP_ADDR_MASK      0x0F
#define USB_ENDP_TYPE_MASK      0x03
#define USB_ENDP_TYPE_CTRL      0x00
#define USB_ENDP_TYPE_ISOCH     0x01
#define USB_ENDP_TYPE_BULK      0x02
#define USB_ENDP_TYPE_INTER     0x03
#endif

#ifndef USB_DEVICE_ADDR
#define USB_DEVICE_ADDR         0x02    /*default addr of USB */
#endif
#ifndef DEFAULT_ENDP0_SIZE
#define DEFAULT_ENDP0_SIZE      8       /* default maximum packet size for endpoint 0 */
#endif
#ifndef MAX_PACKET_SIZE
#define MAX_PACKET_SIZE         64      /* maximum packet size */
#endif
#ifndef USB_BO_CBW_SIZE
#define USB_BO_CBW_SIZE         0x1F    /* total length of CBW command block */
#define USB_BO_CSW_SIZE         0x0D    /* total length of CSW command state block */
#endif
#ifndef USB_BO_CBW_SIG
#define USB_BO_CBW_SIG          0x43425355  /* identification mark of CBW command block 'USBC' */
#define USB_BO_CSW_SIG          0x53425355  /* identification mark of CSW command state block 'USBC'USBS' */
#endif

#ifndef __PACKED
#define __PACKED               __attribute__((packed))
#endif

typedef struct __PACKED _USB_SETUP_REQ {
    UINT8 bRequestType;
    UINT8 bRequest;
    UINT16 wValue;
    UINT16 wIndex;
    UINT16 wLength;
} USB_SETUP_REQ, *PUSB_SETUP_REQ;

typedef struct __PACKED _USB_DEVICE_DESCR {
    UINT8 bLength;
    UINT8 bDescriptorType;
    UINT16 bcdUSB;
    UINT8 bDeviceClass;
    UINT8 bDeviceSubClass;
    UINT8 bDeviceProtocol;
    UINT8 bMaxPacketSize0;
    UINT16 idVendor;
    UINT16 idProduct;
    UINT16 bcdDevice;
    UINT8 iManufacturer;
    UINT8 iProduct;
    UINT8 iSerialNumber;
    UINT8 bNumConfigurations;
} USB_DEV_DESCR, *PUSB_DEV_DESCR;

typedef struct __PACKED _USB_CONFIG_DESCR {
    UINT8 bLength;
    UINT8 bDescriptorType;
    UINT16 wTotalLength;
    UINT8 bNumInterfaces;
    UINT8 bConfigurationValue;
    UINT8 iConfiguration;
    UINT8 bmAttributes;
    UINT8 MaxPower;
} USB_CFG_DESCR, *PUSB_CFG_DESCR;

typedef struct __PACKED _USB_INTERF_DESCR {
    UINT8 bLength;
    UINT8 bDescriptorType;
    UINT8 bInterfaceNumber;
    UINT8 bAlternateSetting;
    UINT8 bNumEndpoints;
    UINT8 bInterfaceClass;
    UINT8 bInterfaceSubClass;
    UINT8 bInterfaceProtocol;
    UINT8 iInterface;
} USB_ITF_DESCR, *PUSB_ITF_DESCR;

typedef struct __PACKED _USB_ENDPOINT_DESCR {
    UINT8 bLength;
    UINT8 bDescriptorType;
    UINT8 bEndpointAddress;
    UINT8 bmAttributes;
    UINT8 wMaxPacketSizeL;
    UINT8 wMaxPacketSizeH;
    UINT8 bInterval;
} USB_ENDP_DESCR, *PUSB_ENDP_DESCR;

typedef struct __PACKED _USB_CONFIG_DESCR_LONG {
    USB_CFG_DESCR   cfg_descr;
    USB_ITF_DESCR   itf_descr;
    USB_ENDP_DESCR  endp_descr[1];
} USB_CFG_DESCR_LONG, *PUSB_CFG_DESCR_LONG;

typedef USB_CFG_DESCR_LONG *PXUSB_CFG_DESCR_LONG;

typedef struct __PACKED  _USB_HUB_DESCR {
    UINT8 bDescLength;
    UINT8 bDescriptorType;
    UINT8 bNbrPorts;
    UINT8 wHubCharacteristicsL;
    UINT8 wHubCharacteristicsH;
    UINT8 bPwrOn2PwrGood;
    UINT8 bHubContrCurrent;
    UINT8 DeviceRemovable;
    UINT8 PortPwrCtrlMask;
} USB_HUB_DESCR, *PUSB_HUB_DESCR;

typedef USB_HUB_DESCR  *PXUSB_HUB_DESCR;

typedef struct __PACKED  _USB_HID_DESCR {
    UINT8 bLength;
    UINT8 bDescriptorType;
    UINT16 bcdHID;
    UINT8 bCountryCode;
    UINT8 bNumDescriptors;
    UINT8 bDescriptorTypeX;
    UINT8 wDescriptorLengthL;
    UINT8 wDescriptorLengthH;
} USB_HID_DESCR, *PUSB_HID_DESCR;

typedef USB_HID_DESCR *PXUSB_HID_DESCR;

typedef struct __PACKED  _UDISK_BOC_CBW {         /* command of BulkOnly USB-FlashDisk */
    UINT32 mCBW_Sig;
    UINT32 mCBW_Tag;
    UINT32 mCBW_DataLen;                /* uppest byte of data length, always is 0 */
    UINT8 mCBW_Flag;                    /* transfer direction and etc. */
    UINT8 mCBW_LUN;
    UINT8 mCBW_CB_Len;                  /* length of command block */
    UINT8 mCBW_CB_Buf[16];              /* command block buffer */
} UDISK_BOC_CBW, *PUDISK_BOC_CBW;

typedef UDISK_BOC_CBW  *PXUDISK_BOC_CBW;

typedef struct __PACKED  _UDISK_BOC_CSW {         /* status of BulkOnly USB-FlashDisk */
    UINT32 mCSW_Sig;
    UINT32 mCSW_Tag;
    UINT32 mCSW_Residue;                /* return: remainder bytes */
    UINT8 mCSW_Status;                  /* return: result status */
} UDISK_BOC_CSW, *PUDISK_BOC_CSW;

typedef UDISK_BOC_CSW  *PXUDISK_BOC_CSW;

#ifdef __cplusplus
}
#endif

#endif  // __USB_TYPE__

/**********************************/
/*********USB high speed**********/
/**********************************/

/* USB high speed device register */
#define R8_USB2_CTRL                (*((PUINT8V)0x40009000))  // RW, USB_high_speed control register
#define  USBHS_UD_LPM_EN            0x80                      // RW, enable LPM
#define  USBHS_UD_DEV_EN            0x20                      // RW, enable USB equipment
#define  USBHS_UD_DMA_EN            0x10                      // RW, enable DMA transmit
#define  USBHS_UD_PHY_SUSPENDM      0x08                      // RW, suspeng USB PHY
#define  USBHS_UD_CLR_ALL           0x04                      // RW, clear all interupt flag
#define  USBHS_UD_RST_SIE           0x02                      // RW, reset USB protocol processor,including end point register
#define  USBHS_UD_RST_LINK          0x01                      // RW, enable LNK layer reset
#define R8_USB2_BASE_MODE           (*((PUINT8V)0x40009001))  // RW, USB_high_speed mode control register
#define  USBHS_UD_SPEED_FULL        0x00
#define  USBHS_UD_SPEED_HIGH        0x01
#define  USBHS_UD_SPEED_LOW         0x02
#define  USBHS_UD_SPEED_TYPE        0x03                      // RW, speed mode excpeted by the equipment,00:full speed, 01:high speed, 10:low speed
#define R8_USB2_INT_EN              (*((PUINT8V)0x40009002))  // RW, USB_high_speed intreurpt enable register
#define  USBHS_UDIE_FIFO_OVER       0x80                      // RW, enable fifo overflow interupt
#define  USBHS_UDIE_LINK_RDY        0x40                      // RW, enable USB conect interupt
#define  USBHS_UDIE_SOF_ACT         0x20                      // RW, enable SOF package received interupt
#define  USBHS_UDIE_TRANSFER        0x10                      // RW, enable USB transmit end interupt
#define  USBHS_UDIE_LPM_ACT         0x08                      // RW, enable lpm transmit end interupt
#define  USBHS_UDIE_BUS_SLEEP       0x04                      // RW, enable usb bus sleep interupt
#define  USBHS_UDIE_SUSPEND         0x02                      // RW, enable usb bus suspend interupt
#define  USBHS_UDIE_BUS_RST         0x01                      // RW, enable usb bus reset interupt
#define R8_USB2_DEV_AD              (*((PUINT8V)0x40009003))  // RW, USB_high_speed device adress register
#define  USBHS_UD_DEV_ADDR          0x7F                      // RW, adress of usb equipment
#define R8_USB2_WAKE_CTRL           (*((PUINT8V)0x40009004))  // RW, USB_high_speed wake up remotely register
#define  USBHS_UD_UD_REMOTE_WKUP    0x01                      // RW1, wake up remotely and auto reset hardware
#define R8_USB2_TEST_MODE           (*((PUINT8V)0x40009005))  // RW, USB_high_speed test mode register
#define  USBHS_UD_TEST_EN           0x80                      // RW, enable test mode
#define  USBHS_UD_TEST_SE0NAK       0x08                      // RW, output SE0 when in test mode
#define  USBHS_UD_TEST_PKT          0x04                      // RW, output one package(including DATA0,data and length of end pont4) when in test mode,not work on virtual equipment
#define  USBHS_UD_TEST_K            0x02                      // RW, output K when in test mode
#define  USBHS_UD_TEST_J            0x01                      // RW, output J when in test mode
#define R16_USB2_LPM_DATA           (*((PUINT16V)0x40009006)) // RW, USB_high_speed power control register
#define  USBHS_UD_LPM_BUSY          0x8000                    // RW, power control busy
#define  USBHS_UD_LPM_DATA          0x07FF                    // RO, power control data
#define R8_USB2_INT_FG              (*((PUINT8V)0x40009008))  // RW, USB_high_speed interupt flag register
#define  USBHS_UDIF_FIFO_OV         0x80                      // RW1, clear fifo overflow interupt flag
#define  USBHS_UDIF_LINK_RDY        0x40                      // RW1, clear USB conect interupt flag
#define  USBHS_UDIF_RX_SOF          0x20                      // RW1, clear SOF package received interupt flag
#define  USBHS_UDIF_TRANSFER        0x10                      // RO,  USB transmit end interupt flag,cleared by USBHS_UDMS_HS_MOD
#define  USBHS_UDIF_LPM_ACT         0x08                      // RW1, clear lpm transmit end interupt flag
#define  USBHS_UDIF_BUS_SLEEP       0x04                      // RW1, clear usb bus sleep interupt flag
#define  USBHS_UDIF_SUSPEND         0x02                      // RW1, clear usb bus suspend interupt flag
#define  USBHS_UDIF_BUS_RST         0x01                      // RW1, clear usb bus reset interupt flag
#define R8_USB2_INT_ST              (*((PUINT8V)0x40009009))  // RW, USB_high_speed interupt status register
#define  USBHS_UDIS_EP_DIR          0x10                      // RO, end point tranfer diector of data
#define  USBHS_UDIS_EP_ID_MASK      0x07                      // RO, number of end point which data transmission occured
#define R8_USB2_MIS_ST              (*((PUINT8V)0x4000900A))  // RW, USB_high_speed miscellaneous register
#define  USBHS_UDMS_HS_MOD          0x80                      // RO, host with high speed
#define  USBHS_UDMS_SUSP_REQ        0x10                      // RO, requirment of suspending USB
#define  USBHS_UDMS_SIE_FREE        0x08                      // RO, USB free state
#define  USBHS_UDMS_SLEEP           0x04                      // RO, USB sleep state
#define  USBHS_UDMS_SUSPEND         0x02                      // RO, USB in suspend state
#define  USBHS_UDMS_READY           0x01                      // RO, USB in connected state
#define R16_USB2_FRAME_NO           (*((PUINT16V)0x4000900C)) // RW, USB_high_speed frame number register
#define  USBHS_UD_MFRAME_NO         0xE000
#define  USBHS_UD_FRAME_NO          0x07FF
#define R16_USB2_BUS                (*((PUINT16V)0x4000900E)) // RW, USB_high_speed bus status register
#define  USBHS_USB_DM_ST            0x08
#define  USBHS_USB_DP_ST            0x04
#define  USB_WAKEUP                 0x01
#define R16_U2EP_TX_EN              (*((PUINT16V)0x40009010)) // RW, USB_high_speed end point transmit enable register
/* Bit definition for R16_U2EP_TX_EN & R16_U2EP_RX_EN register */
#define RB_EP0_EN                   0x0001
#define RB_EP1_EN                   0x0002
#define RB_EP2_EN                   0x0004
#define RB_EP3_EN                   0x0008
#define RB_EP4_EN                   0x0010
#define RB_EP5_EN                   0x0020
#define RB_EP6_EN                   0x0040
#define RB_EP7_EN                   0x0080
#define RB_EP8_EN                   0x0100
#define RB_EP9_EN                   0x0200
#define RB_EP10_EN                  0x0400
#define RB_EP11_EN                  0x0800
#define RB_EP12_EN                  0x1000
#define RB_EP13_EN                  0x2000
#define RB_EP14_EN                  0x4000
#define RB_EP15_EN                  0x8000

#define R16_U2EP_RX_EN              (*((PUINT16V)0x40009012))   // RW, USB_high_speed end point receive enableregister
#define  USBHS_UEP_RX_EN            0xFFFF
#define R16_U2EP_T_TOG_AUTO         (*((PUINT16V)0x40009014))   // RW, USB_high_speed end point transmit auto toggle enable register
#define  USBHS_UEP_T_TOG_AUTO       0xFF
#define R16_U2EP_R_TOG_AUTO         (*((PUINT16V)0x40009016))   // RW, USB_high_speed end point receive auto toggle enable register
#define  USBHS_UEP_R_TOG_AUTO       0xFF
#define R8_U2EP_T_BURST             (*((PUINT8V)0x40009018))    // RW, USB_high_speed end point transmit burst register
#define  USBHS_UEP_T_BURST_EN       0xFF
#define R8_U2EP_T_BURST_MODE        (*((PUINT8V)0x40009019))    // RW, USB_high_speed end point transmit burst mode register
#define  USBHS_UEP_T_BURST_MODE     0xFF
#define R8_U2EP_R_BURST             (*((PUINT8V)0x4000901A))    // RW, USB_high_speed end point receive burst register
#define  USBHS_UEP_R_BURST_EN       0xFF
#define R8_U2EP_R_RES_MODE          (*((PUINT8V)0x4000901B))    // RW, USB_high_speed end point transmit reply mode register
#define  USBHS_UEP_R_RES_MODE       0xFF
#define R32_U2EP_AF_MODE            (*((PUINT32V)0x4000901C))   // RW, USB_high_speed end point multiplexing register
#define  USBHS_UEP_T_AF             0xFE
#define R32_U2EP0_DMA               (*((PUINT32V)0x40009020))   // RW, USB_high_speed end point0 begin adress of DMA buffer register
#define  UEPn_DMA                   0x01FFFF
#define R32_U2EP1_RX_DMA            (*((PUINT32V)0x40009024))   // RW, USB_high_speed end point1 begin adress of DMA receive buffer register
#define R32_U2EP2_RX_DMA            (*((PUINT32V)0x40009028))   // RW, USB_high_speed end point2 begin adress of DMA receive buffer register
#define R32_U2EP3_RX_DMA            (*((PUINT32V)0x4000902C))   // RW, USB_high_speed end point3 begin adress of DMA receive buffer register
#define R32_U2EP4_RX_DMA            (*((PUINT32V)0x40009030))   // RW, USB_high_speed end point4 begin adress of DMA receive buffer register
#define R32_U2EP5_RX_DMA            (*((PUINT32V)0x40009034))   // RW, USB_high_speed end point5 begin adress of DMA receive buffer register
#define R32_U2EP6_RX_DMA            (*((PUINT32V)0x40009038))   // RW, USB_high_speed end point6 begin adress of DMA receive buffer register
#define R32_U2EP7_RX_DMA            (*((PUINT32V)0x4000903C))   // RW, USB_high_speed end point7 begin adress of DMA receive buffer register
#define  UEPn_RX_DMA                0x01FFFF
#define R32_U2EP1_TX_DMA            (*((PUINT32V)0x40009040))   // RW, USB_high_speed end point1 begin adress of DMA transmit buffer register
#define R32_U2EP2_TX_DMA            (*((PUINT32V)0x40009044))   // RW, USB_high_speed end point2 begin adress of DMA transmit buffer register
#define R32_U2EP3_TX_DMA            (*((PUINT32V)0x40009048))   // RW, USB_high_speed end point3 begin adress of DMA transmit buffer register
#define R32_U2EP4_TX_DMA            (*((PUINT32V)0x4000904C))   // RW, USB_high_speed end point4 begin adress of DMA transmit buffer register
#define R32_U2EP5_TX_DMA            (*((PUINT32V)0x40009050))   // RW, USB_high_speed end point5 begin adress of DMA transmit buffer register
#define R32_U2EP6_TX_DMA            (*((PUINT32V)0x40009054))   // RW, USB_high_speed end point6 begin adress of DMA transmit buffer register
#define R32_U2EP7_TX_DMA            (*((PUINT32V)0x40009058))   // RW, USB_high_speed end point7 begin adress of DMA transmit buffer register
#define  UEPn_TX_DMA                0x01FFFF
#define R32_U2EP0_MAX_LEN           (*((PUINT32V)0x4000905C))   // RW, USB_high_speed end point0 max length package register
#define R32_U2EP1_MAX_LEN           (*((PUINT32V)0x40009060))   // RW, USB_high_speed end point1 max length package register
#define R32_U2EP2_MAX_LEN           (*((PUINT32V)0x40009064))   // RW, USB_high_speed end point2 max length package register
#define R32_U2EP3_MAX_LEN           (*((PUINT32V)0x40009068))   // RW, USB_high_speed end point3 max length package register
#define R32_U2EP4_MAX_LEN           (*((PUINT32V)0x4000906C))   // RW, USB_high_speed end point4 max length package register
#define R32_U2EP5_MAX_LEN           (*((PUINT32V)0x40009070))   // RW, USB_high_speed end point5 max length package register
#define R32_U2EP6_MAX_LEN           (*((PUINT32V)0x40009074))   // RW, USB_high_speed end point6 max length package register
#define R32_U2EP7_MAX_LEN           (*((PUINT32V)0x40009078))   // RW, USB_high_speed end point7 max length package register
#define  UEPn_MAX_LEN               0x007F
#define R16_U2EP0_RX_LEN            (*((PUINT16V)0x4000907C))   // RW, USB_high_speed end point0 length of receive register
#define  UEP0_RX_LEN                0x007F
#define R16_U2EP1_RX_LEN            (*((PUINT16V)0x40009080))   // RW, USB_high_speed end point1 single received length register
#define R16_U2EP1_R_SIZE            (*((PUINT16V)0x40009082))   // RW, USB_high_speed end point1 total received length register
#define R16_U2EP2_RX_LEN            (*((PUINT16V)0x40009084))   // RW, USB_high_speed end point2 single received length register
#define R16_U2EP2_R_SIZE            (*((PUINT16V)0x40009086))   // RW, USB_high_speed end point2 total received length register
#define R16_U2EP3_RX_LEN            (*((PUINT16V)0x40009088))   // RW, USB_high_speed end point3 single received length register
#define R16_U2EP3_R_SIZE            (*((PUINT16V)0x4000908A))   // RW, USB_high_speed end point3 total received length register
#define R16_U2EP4_RX_LEN            (*((PUINT16V)0x4000908C))   // RW, USB_high_speed end point4 single received length register
#define R16_U2EP4_R_SIZE            (*((PUINT16V)0x4000908E))   // RW, USB_high_speed end point4 total received length register
#define R16_U2EP5_RX_LEN            (*((PUINT16V)0x40009090))   // RW, USB_high_speed end point5 single received length register
#define R16_U2EP5_R_SIZE            (*((PUINT16V)0x40009092))   // RW, USB_high_speed end point5 total received length register
#define R16_U2EP6_RX_LEN            (*((PUINT16V)0x40009094))   // RW, USB_high_speed end point6 single received length register
#define R16_U2EP6_R_SIZE            (*((PUINT16V)0x40009096))   // RW, USB_high_speed end point6 total received length register
#define R16_U2EP7_RX_LEN            (*((PUINT16V)0x40009098))   // RW, USB_high_speed end point7 single received length register
#define R16_U2EP7_R_SIZE            (*((PUINT16V)0x4000909A))   // RW, USB_high_speed end point7 total received length register
#define  UEPn_RX_LEN                0xFFFF
#define  UEPn_R_SIZE                0xFFFF
#define R16_U2EP0_T_LEN             (*((PUINT16V)0x4000909C))   // RW, USB_high_speed end point0 length of transmission register
#define  UEP0_T_LEN                 0x7F
#define R8_U2EP0_TX_CTRL            (*((PUINT8V)0x4000909E))    // RW, USB_high_speed end point0 transmit control register
#define R8_U2EP0_RX_CTRL            (*((PUINT8V)0x4000909F))    // RW, USB_high_speed end point0 receive control register
#define R16_U2EP1_T_LEN             (*((PUINT16V)0x400090A0))   // RW, USB_high_speed end point1 length of transmission register
#define R8_U2EP1_TX_CTRL            (*((PUINT8V)0x400090A2))    // RW, USB_high_speed end point1 transmit control register
#define R8_U2EP1_RX_CTRL            (*((PUINT8V)0x400090A3))    // RW, USB_high_speed end point1 receive control register
#define R16_U2EP2_T_LEN             (*((PUINT16V)0x400090A4))   // RW, USB_high_speed end point2 length of transmission register
#define R8_U2EP2_TX_CTRL            (*((PUINT8V)0x400090A6))    // RW, USB_high_speed end point2 transmit control register
#define R8_U2EP2_RX_CTRL            (*((PUINT8V)0x400090A7))    // RW, USB_high_speed end point2 receive control register
#define R16_U2EP3_T_LEN             (*((PUINT16V)0x400090A8))   // RW, USB_high_speed end point3 length of transmission register
#define R8_U2EP3_TX_CTRL            (*((PUINT8V)0x400090AA))    // RW, USB_high_speed end point3 transmit control register
#define R8_U2EP3_RX_CTRL            (*((PUINT8V)0x400090AB))    // RW, USB_high_speed end point3 receive control register
#define R16_U2EP4_T_LEN             (*((PUINT16V)0x400090AC))   // RW, USB_high_speed end point4 length of transmission register
#define R8_U2EP4_TX_CTRL            (*((PUINT8V)0x400090AE))    // RW, USB_high_speed end point4 transmit control register
#define R8_U2EP4_RX_CTRL            (*((PUINT8V)0x400090AF))    // RW, USB_high_speed end point4 receive control register
#define R16_U2EP5_T_LEN             (*((PUINT16V)0x400090B0))   // RW, USB_high_speed end point5 length of transmission register
#define R8_U2EP5_TX_CTRL            (*((PUINT8V)0x400090B2))    // RW, USB_high_speed end point5 transmit control register
#define R8_U2EP5_RX_CTRL            (*((PUINT8V)0x400090B3))    // RW, USB_high_speed end point5 receive control register
#define R16_U2EP6_T_LEN             (*((PUINT16V)0x400090B4))   // RW, USB_high_speed end point6 length of transmission register
#define R8_U2EP6_TX_CTRL            (*((PUINT8V)0x400090B6))    // RW, USB_high_speed end point6 transmit control register
#define R8_U2EP6_RX_CTRL            (*((PUINT8V)0x400090B7))    // RW, USB_high_speed end point6 receive control register
#define R16_U2EP7_T_LEN             (*((PUINT16V)0x400090B8))   // RW, USB_high_speed end point7 length of transmission register
#define R8_U2EP7_TX_CTRL            (*((PUINT8V)0x400090BA))    // RW, USB_high_speed end point7 transmit control register
#define R8_U2EP7_RX_CTRL            (*((PUINT8V)0x400090BB))    // RW, USB_high_speed end point7 receive control register
/**R16_UEPn_T_LEN**/ 
#define UEPn_T_LEN                  0xFFFF
/**R8_UEPn_TX_CTRL**/ 
#define USBHS_UEP_T_DONE            0x80
#define USBHS_UEP_T_NAK_ACT         0x40
#define USBHS_UEP_T_TOG_MASK        0x0C
#define USBHS_UEP_T_TOG_MDATA       0x0C
#define USBHS_UEP_T_TOG_DATA2       0x08
#define USBHS_UEP_T_TOG_DATA1       0x04
#define USBHS_UEP_T_TOG_DATA0       0x00
#define USBHS_UEP_T_RES_MASK        0x03
#define USBHS_UEP_T_RES_ACK         0x02
#define USBHS_UEP_T_RES_STALL       0x01
#define USBHS_UEP_T_RES_NAK         0x00
 
/**R8_UEPn_RX_CTRL**/ 
#define USBHS_UEP_R_DONE            0x80
#define USBHS_UEP_R_NAK_ACT         0x40
#define USBHS_UEP_R_NAK_TOG         0x20
#define USBHS_UEP_R_TOG_MATCH       0x10
#define USBHS_UEP_R_SETUP_IS        0x08
#define USBHS_UEP_R_TOG_MASK        0x0C
#define USBHS_UEP_R_TOG_MDATA       0x0C
#define USBHS_UEP_R_TOG_DATA2       0x08
#define USBHS_UEP_R_TOG_DATA1       0x04
#define USBHS_UEP_R_TOG_DATA0       0x00
#define USBHS_UEP_R_RES_MASK        0x03
#define USBHS_UEP_R_RES_ACK         0x02
#define USBHS_UEP_R_RES_STALL       0x01
#define USBHS_UEP_R_RES_NAK         0x00
 
