hathach/tinyusb/src/portable/wch/CH585SFR.h
#define R16_U2EP_T_ISO              (*((PUINT16V)0x400090BC))   // RW, USB_high_speed end point transmit sync mode register
#define  USBHS_UEP1_T_ISO_EN        0x02
#define  USBHS_UEP2_T_ISO_EN        0x04
#define  USBHS_UEP3_T_ISO_EN        0x08
#define  USBHS_UEP4_T_ISO_EN        0x10
#define  USBHS_UEP5_T_ISO_EN        0x20
#define  USBHS_UEP6_T_ISO_EN        0x40
#define  USBHS_UEP7_T_ISO_EN        0x80
#define R16_U2EP_R_ISO              (*((PUINT16V)0x400090BE))   // RW, USB_high_speed end point receive sync mode register
#define  USBHS_UEP1_R_ISO_EN        0x02
#define  USBHS_UEP2_R_ISO_EN        0x04
#define  USBHS_UEP3_R_ISO_EN        0x08
#define  USBHS_UEP4_R_ISO_EN        0x10
#define  USBHS_UEP5_R_ISO_EN        0x20
#define  USBHS_UEP6_R_ISO_EN        0x40
#define  USBHS_UEP7_R_ISO_EN        0x80
 
/* USB high speed host register  */
#define R8_U2H_CFG                  (*((PUINT8V)0x40009100))   // RW, USB_high_speed register
#define  USBHS_UH_LPM_EN            0x80
#define  USBHS_UH_FORCE_FS          0x40
#define  USBHS_UH_SOF_EN            0x20
#define  USBHS_UH_DMA_EN            0x10
#define  USBHS_UH_PHY_SUSPENDM      0x08
#define  USBHS_UH_CLR_ALL           0x04
#define  USBHS_RST_SIE              0x02
#define  USBHS_RST_LINK             0x01
#define R8_U2H_INT_EN               (*((PUINT8V)0x40009102))   // RW, USB_high_speed register
#define  USBHS_UHIE_FIFO_OVER       0x80
#define  USBHS_UHIE_TX_HALT         0x40
#define  USBHS_UHIE_SOF_ACT         0x20
#define  USBHS_UHIE_TRANSFER        0x10
#define  USBHS_UHIE_RESUME_ACT      0x08
#define  USBHS_UHIE_WKUP_ACT        0x04
#define R8_U2H_DEV_AD             (*((PUINT8V)0x40009103))   // RW, USB_high_speed register
#define  USBHS_UH_DEV_ADDR          0xFF
#define R32_U2H_CONTROL             (*((PUINT32V)0x40009104))   // RW, USB_high_speed register
#define  USBHS_UH_RX_NO_RES         0x800000
#define  USBHS_UH_TX_NO_RES         0x400000
#define  USBHS_UH_RX_NO_DATA        0x200000
#define  USBHS_UH_TX_NO_DATA        0x100000
#define  USBHS_UH_PRE_PID_EN        0x080000
#define  USBHS_UH_SPLIT_VALID       0x040000
#define  USBHS_UH_LPM_VALID         0x020000
#define  USBHS_UH_HOST_ACTION       0x010000
#define  USBHS_UH_BUF_MODE          0x0400
#define  USBHS_UH_T_TOG_MASK        0x0300
#define  USBHS_UH_T_TOG_MDATA       0x0300
#define  USBHS_UH_T_TOG_DATA2       0x0200
#define  USBHS_UH_T_TOG_DATA1       0x0100
#define  USBHS_UH_T_TOG_DATA0       0x0000
#define  USBHS_UH_T_ENDP_MASK       0xF0
#define  USBHS_UH_T_TOKEN_MASK      0x0F

#define R8_U2H_INT_FLAG             (*((PUINT8V)0x40009108))   // RW, USB_high_speed register
#define  USBHS_UHIF_FIFO_OVER       0x80
#define  USBHS_UHIF_TX_HALT         0x40
#define  USBHS_UHIF_SOF_ACT         0x20
#define  USBHS_UHIF_TRANSFER        0x10
#define  USBHS_UHIF_RESUME_ACT      0x08
#define  USBHS_UHIF_WKUP_ACT        0x04
#define R8_U2H_INT_ST               (*((PUINT8V)0x40009109))   // RW, USB_high_speed register
#define  USBHS_UHIF_PORT_RX_RESUME  0x10
#define  USBHS_UH_R_TOKEN_MASK      0x0F
#define R8_U2H_MIS_ST               (*((PUINT8V)0x4000910A))   // RW, USB_high_speed register
#define  USBHS_UHMS_BUS_SE0         0x80
#define  USBHS_UHMS_BUS_J           0x40
#define  USBHS_UHMS_LINESTATE       0x30
#define  USBHS_UHMS_USB_WAKEUP      0x08
#define  USBHS_UHMS_SOF_ACT         0x04
#define  USBHS_UHMS_SOF_PRE         0x02
#define  USBHS_UHMS_SOF_FREE        0x01
#define R32_U2H_LPM_DATA            (*((PUINT32V)0x4000910C))   // RW, USB_high_speed register
#define  USBHS_UH_LPM_DATA          0x07FF
#define R32_U2H_SPLIT_DATA          (*((PUINT32V)0x40009110))   // RW, USB_high_speed register
#define  USBHS_UH_SPLIT_DATA        0x07FFFF
#define R32_U2H_FRAME               (*((PUINT32V)0x40009114))   // RW, USB_high_speed register
#define  USBHS_UH_SOF_CNT_CLR       0x02000000
#define  USBHS_UH_SOF_CNT_EN        0x01000000
#define  USBHS_UH_MFRAME_NO         0x070000
#define  USBHS_UH_FRAME_NO          0x07FF
#define R32_U2H_TX_LEN              (*((PUINT32V)0x40009118))   // RW, USB_high_speed register
#define  USBHS_UH_TX_LEN            0x07FF
#define R32_U2H_RX_LEN              (*((PUINT32V)0x4000911C))   // RW, USB_high_speed register
#define  USBHS_UH_RX_LEN            0x07FF
#define R32_U2H_RX_MAX_LEN          (*((PUINT32V)0x40009120))   // RW, USB_high_speed register
#define  USBHS_UH_RX_MAX_LEN        0x07FF
#define R32_U2H_RX_DMA              (*((PUINT32V)0x40009124))   // RW, USB_high_speed register
#define  USBHS_R32_UH_RX_DMA        0x01FFFF
#define R32_U2H_TX_DMA              (*((PUINT32V)0x40009128))   // RW, USB_high_speed register
#define  USBHS_R32_UH_TX_DMA        0x01FFFF
#define R32_U2H_PORT_CTRL           (*((PUINT32V)0x4000912C))   // RW, USB_high_speed register
#define  USBHS_UH_BUS_RST_LONG      0x010000
#define  USBHS_UH_PORT_SLEEP_BESL   0xF000
#define  USBHS_UH_CLR_PORT_SLEEP    0x0100
#define  USBHS_UH_CLR_PORT_CONNECT  0x20
#define  USBHS_UH_CLR_PORT_EN       0x10
#define  USBHS_UH_SET_PORT_SLEEP    0x08
#define  USBHS_UH_CLR_PORT_SUSP     0x04
#define  USBHS_UH_SET_PORT_SUSP     0x02
#define  USBHS_UH_SET_PORT_RESET    0x01
#define R8_U2H_PORT_CFG             (*((PUINT8V)0x40009130))   // RW, USB_high_speed register
#define  USBHS_UH_PD_EN             0x80
#define  USBHS_UH_HOST_EN           0x01
#define R8_U2H_PORT_INT_EN          (*((PUINT8V)0x40009132))   // RW, USB_high_speed register
#define  USBHS_UHIE_PORT_SLP        0x20
#define  USBHS_UHIE_PORT_RESET      0x10
#define  USBHS_UHIE_PORT_SUSP       0x04
#define  USBHS_UHIE_PORT_EN         0x02
#define  USBHS_UHIE_PORT_CONNECT    0x01
#define R8_U2H_PORT_TEST_CT         (*((PUINT8V)0x40009133))   // RW, USB_high_speed register
#define  USBHS_UH_TEST_FORCE_EN     0x04
#define  USBHS_UH_TEST_K            0x02
#define  USBHS_UH_TEST_J            0x01
#define R16_U2H_PORT_ST             (*((PUINT16V)0x40009134))  // RW, USB_high_speed register
#define  USBHS_UHIS_PORT_TEST       0x0800
#define  USBHS_UHIS_PORT_SPEED_MASK 0x0600
#define  USBHS_UHIS_PORT_HS         0x0400
#define  USBHS_UHIS_PORT_LS         0x0200
#define  USBHS_UHIS_PORT_FS         0x0000
#define  USBHS_UHIS_PORT_SLP        0x20
#define  USBHS_UHIS_PORT_RST        0x10
#define  USBHS_UHIS_PORT_SUSP       0x04
#define  USBHS_UHIS_PORT_EN         0x02
#define  USBHS_UHIS_PORT_CONNECT    0x01
#define R8_U2H_PORT_CHG             (*((PUINT8V)0x40009136))
#define  USBHS_UHIF_PORT_SLP        0x20
#define  USBHS_UHIF_PORT_RESET      0x10
#define  USBHS_UHIF_PORT_SUSP       0x04
#define  USBHS_UHIF_PORT_EN         0x02
#define  USBHS_UHIF_PORT_CONNECT    0x01
#define R32_U2H_BC_CTRL             (*((PUINT32V)0x4000913C))
#define  UDM_VSRC_ACT               0x0400
#define  UDM_BC_VSRC                0x0200
#define  UDP_BC_VSRC                0x0100
#define  BC_AUTO_MODE               0x40
#define  UDM_BC_CMPE                0x20
#define  UDP_BC_CMPE                0x10
#define  UDM_BC_CMPO                0x02
#define  UDP_BC_CMPO                0x01
#define R8_USBHS_PLL_CTRL           (*((PUINT8V)0x40009200))
#define  USBHS_PLL_EN               0x04
#define  USBHS_PLL_LOWPOW           0x02
#define  USBHS_PLL_CKSEL            0x01
